tests/benchmark/results/wrk2_final/select/c1200.log
Running 15s test @ http://127.0.0.1:9569/hello
  4 threads and 1200 connections
  Thread calibration: mean lat.: 762.141ms, rate sampling interval: 2011ms
  Thread calibration: mean lat.: 326.031ms, rate sampling interval: 1900ms
  Thread calibration: mean lat.: 284.896ms, rate sampling interval: 2018ms
  Thread calibration: mean lat.: 281.122ms, rate sampling interval: 2006ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     -nanus    -nanus   0.00us    0.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.00us
 75.000%    0.00us
 90.000%    0.00us
 99.000%    0.00us
 99.900%    0.00us
 99.990%    0.00us
 99.999%    0.00us
100.000%    0.00us

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.000     1.000000            0          inf
#[Mean    =         -nan, StdDeviation   =         -nan]
#[Max     =        0.000, Total count    =            0]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  120100 requests in 15.50s, 11.57MB read
  Socket errors: connect 0, read 1, write 0, timeout 7651
Requests/sec:   7747.60
Transfer/sec:    764.17KB