tests/benchmark/results/wrk2_final/select/c200.log
Running 15s test @ http://127.0.0.1:9569/hello
  4 threads and 200 connections
  Thread calibration: mean lat.: 36.984ms, rate sampling interval: 248ms
  Thread calibration: mean lat.: 70.378ms, rate sampling interval: 284ms
  Thread calibration: mean lat.: 158.148ms, rate sampling interval: 631ms
  Thread calibration: mean lat.: 105.974ms, rate sampling interval: 455ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     -nanus    -nanus   0.00us    0.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.00us
 75.000%    0.00us
 90.000%    0.00us
 99.000%    0.00us
 99.900%    0.00us
 99.990%    0.00us
 99.999%    0.00us
100.000%    0.00us

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.000     1.000000            0          inf
#[Mean    =         -nan, StdDeviation   =         -nan]
#[Max     =        0.000, Total count    =            0]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  20000 requests in 16.25s, 1.93MB read
  Socket errors: connect 0, read 0, write 0, timeout 1452
Requests/sec:   1230.71
Transfer/sec:    121.39KB