tests/benchmark/results/wrk2_final/select/c50.log
Running 15s test @ http://127.0.0.1:9619/hello
  4 threads and 50 connections
  Thread calibration: mean lat.: 3.030ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.086ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 3.579ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 3.607ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     -nanus    -nanus   0.00us    0.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.00us
 75.000%    0.00us
 90.000%    0.00us
 99.000%    0.00us
 99.900%    0.00us
 99.990%    0.00us
 99.999%    0.00us
100.000%    0.00us

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.000     1.000000            0          inf
#[Mean    =         -nan, StdDeviation   =         -nan]
#[Max     =        0.000, Total count    =            0]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4800 requests in 16.06s, 473.44KB read
  Socket errors: connect 0, read 0, write 0, timeout 336
Requests/sec:    298.86
Transfer/sec:     29.48KB