tests/benchmark/results/wrk2_final/select/c800.log
Running 15s test @ http://127.0.0.1:9569/hello
  4 threads and 800 connections
  Thread calibration: mean lat.: 23.879ms, rate sampling interval: 157ms
  Thread calibration: mean lat.: 15.912ms, rate sampling interval: 89ms
  Thread calibration: mean lat.: 30.693ms, rate sampling interval: 184ms
  Thread calibration: mean lat.: 93.541ms, rate sampling interval: 315ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     -nanus    -nanus   0.00us    0.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.00us
 75.000%    0.00us
 90.000%    0.00us
 99.000%    0.00us
 99.900%    0.00us
 99.990%    0.00us
 99.999%    0.00us
100.000%    0.00us

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.000     1.000000            0          inf
#[Mean    =         -nan, StdDeviation   =         -nan]
#[Max     =        0.000, Total count    =            0]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  80100 requests in 15.00s, 7.72MB read
  Socket errors: connect 0, read 1, write 0, timeout 5241
Requests/sec:   5339.54
Transfer/sec:    526.65KB